#################################################################
# Задание 1 (Константа + int)
#################################################################
N = 5

try:
    f_val = int(input("Введите целое число: "))
    print(f"Сумма константы {N} и числа {f_val} = {N+f_val}")
except Exception as E:
    print(E)


#################################################################
# Задание 2 (int + fl + fl)
#################################################################
try:
    num_i, num_f1, num_f2 = map(float, input("Введите 3 числа: целое и 2 вещественных (через пробел): ").split())

    num_i = int(num_i)
    num_f1, num_f2 = round(num_f1, 2), round(num_f2, 2)

    S = num_i + num_f1 + num_f2

    print(f"Сумма трех чисел {num_i}, {num_f1} и {num_f2} = {S}")

except Exception as E:
    print(E)


#################################################################
# Задание 1 (Константа + int)
#################################################################
from math import *

while True:
    x = float(input("Введите x [2, 3]: "))
    if 2 <= x <= 3:
        break

    print("Введите число в заданном интервале")

y = 3*sin(sqrt(x)) + 0.35*x - 3.8

print(f"Значение  <i>у=3sin √𝑥+0.35x - 3.8</i> в точке {x} = {y}")