#################################################################
# Задание 1
#################################################################

# a, b = map(float, input("Введите 2 числа: ").split())
#
# if a>b:
#     print("Верно")
# else:
#     print("Не верно")


#################################################################
# Задание 2 поместится ли круг в квадрате.
# Проверьте решение при: 1) r = 3,2; s = 3,5; 2) r = 3,2; s = 4; 3) r = 6; s = 9.
#################################################################
# from math import *
#
# print(pi)
#
# r, S = map(float, input("Введите площадь круга и квадрата (через пробел): ").split())
#
# a = sqrt(S)
# d = sqrt(2*S)
#
# D = sqrt(r/pi)*2
#
# if a>=D:
#     print(f"В квадрате с S = {S} и диагональю {d} поместится круг S = {r} и диаметром {D}")
# else:
#     print(f"В квадрате с S = {S} и диагональю {d} НЕ поместится круг S = {r} и диаметром {D}")


#################################################################
# Задание 3 Функция
#################################################################
x = float(input("Введите аргумент функции (х): "))

if abs(x)>=1:
    y = 1
else:
    y = abs(x)

print(f"Значение кусочной функции в точке {x} = {y}")