# # Номер 2
# s = 0
#
# for i in range(1, 11):
#     s += 1/i
#     print(f"Член последовательности: 1/{i} {1/i},  Сумма: {s}")
#
# print(f"\nИтого: сумма = {s}")
#
# # Номер 7
# # def fact(n):
# #     if n == 1:
# #         return 1
# #     return n*fact(n-1)
#
# x = int(input("Введите целое число, факториал которого вы хотите посчитать: "))
# result = 1
# for i in range(1, x + 1):
#     result *= i
#     print(f"Факториал {i} = {result}")
#
# print(f"Факториал числа {x} = {result}")
# #
# # # Номер 10
# n = 1
# for i in range(1, 8):
#     print(f"{n}*3 = {n*3}")
#     n *= 3
#
# print(f'3 в 7й степени = {n}')
#
# # Номер 15
# n = int(input("Укажите член последовательности: "))
#
# c_list = [1, 2]
# s_list = [1, 1]
#
# for i in range(3, n+1):
#     n_c = c_list[-1] + c_list[-2]
#     n_s = s_list[-1] + s_list[-2]
#
#     c_list.append(n_c)
#     s_list.append(n_s)
#
# for i in range(0, n-1):
#     print(f"{c_list[i]} / {s_list[i]}")
#
# print(f"Ответ: {c_list[n-1]}/{s_list[n-1]}")

# Уровень 2 номер 2
# 	Определить	наибольшее	значение	сомножителя	n,	для
# которого	произведение	р	=	1⋅4⋅7⋅...⋅n	не	превышает	L	=	30	000

# p = 1
# cnt = 0
# n = 1
# while p<30000:
#     p = p*n
#     print(f'Множитель {n} : прроизведение {p}')
#     n += 3
#     cnt += 1
#
# print(f"Наибольшее значение сомножителя	n,	для	которого произведение	р	=	1⋅4⋅7⋅...⋅n	не	превышает	L	=	30	000 : {n-6}")
#
#
# # Задача 6
# # 	В	задаче	18	уровня	I	определить,	через	какое	время	в
# # замкнутом	объеме	будет	находиться	10^5	клеток.
# n = 10
# cnt = 0
# while n < 100000:
#     print(f"Часов прошло: {cnt}- амеб: {n}")
#     n*=2
#     cnt +=3
#
#
# print(f"\n!Итог! Часов прошло {cnt}, амеб: {n}\n")
#
# # 8.	Вкладчик	положил	в	банк	10	000	рублей	под	8	%	в	ме
# # сяц.	Определить,	через	какое	время	сумма	удвоится.
#
# n = 10000
# s = n
# cnt = 0
#
# while s<n*2:
#     s *= 1.08
#     cnt +=1
#     print(f"Месяцев прошло: {cnt}, сумма: {s}")
# print(f"\n!ИТОГО! Месяцев прошло: {cnt}, сумма: {round(s)}\n")

# Уровень 3
# Номер 4
# import math
#
# a, b, h = 0.1, 1, 0.1
# x = a
# s = 0
#
# while x<=b:
#     i=0
#     n = 1
#     s=0
#     while n>0.0001:
#         i2 = 2*i
#
#         n = ((i2 + 1)*(x**i2))/math.factorial(i)
#         s+=n
#         i += 1
#         print(f"Значение n {n}")
#     print(f'Последний член последовательности: {n}')
#     x2 = x*x
#     y = (1+ (2*x2)**2)*(math.e**x2)
#     print(f'X: {x}, сумма: {s}, функция: {y}')
#     x+=h
#
# print(f'\nсумма: {s}\n')


from math import factorial, e

x = 0.1

h = 0.1

b = 1

while x <= b:

    print(f"x = {x}")

    sum = 0

    i = 0

    val = 0.0001

    while abs(val) >= 0.0001:
        x2i = i*2
        val = ((i*2 + 1)*(x** (2*i) )) / (factorial(i))

        sum += val

        print(f'При i = {i} значение = {val}  сумма {sum} (y = {(1+2*(x**2))*(e**(x**2))}')

        i += 1

    x = round((x + h), 4)

